node/envelope.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:createPlasmid xmlns:ns2="https://api.registry.jbei.org/">
            <sessionId>c1f3d355e500df361b30d38362ef0980a5b9d12c</sessionId>
            <plasmid>
                <bioSafetyLevel>1</bioSafetyLevel>
                <creator>Hector Plahar</creator>
                <entryFundingSources>
                    <fundingSource>
                        <fundingSource>DOE</fundingSource>
                        <principalInvestigator>PI</principalInvestigator>
                    </fundingSource>
                </entryFundingSources>
                <names>
                    <name>Test</name>
                </names>
                <owner>Hector Plahar</owner>
                <ownerEmail>haplahar@lbl.gov</ownerEmail>
                <shortDescription>short description</shortDescription>
                <status>complete</status>
                <circular>false</circular>
            </plasmid>
        </ns2:createPlasmid>
    </soap:Body>
</soap:Envelope>

---

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://cxf.apache.org/bindings/xformat" xmlns:tns="https://api.registry.jbei.org/">
  <soap:Header></soap:Header>
  <soap:Body>
    <tns:createPlasmid>
      <sessionId>c1f3d355e500df361b30d38362ef0980a5b9d12c</sessionId>
      <plasmid>
        <creator>creator</creator>
        <owner>Rodrigo Pavez</owner>
        <ownerEmail>rpavez@teselagen.com</ownerEmail>
        <shortDescription>short description</shortDescription>
        <status>Complete</status>
        <bioSafetyLevel>1</bioSafetyLevel>
        <names>
          <name>pTSH118</name>
        </names>
        <links></links>
        <entryFundingSources>
          <fundingSource>
            <fundingSource>test</fundingSource>
            <principalInvestigator>Rodrigo</principalInvestigator>
          </fundingSource>
        </entryFundingSources>
      </plasmid>
    </tns:createPlasmid>
  </soap:Body>
</soap:Envelope>
